andrew-2.3.1/run/tutorials/multiphase/interPhaseChangeDyMFoam/propeller/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inlet
    {
        type            patch;
        nFaces          652;
        startFace       1576984;
    }
    outlet
    {
        type            patch;
        nFaces          112;
        startFace       1577636;
    }
    outerCylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          640;
        startFace       1577748;
    }
    propellerTip
    {
        type            wall;
        inGroups        1(wall);
        nFaces          21703;
        startFace       1578388;
    }
    propellerStem1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       1600091;
    }
    propellerStem2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          576;
        startFace       1600283;
    }
    propellerStem3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1536;
        startFace       1600859;
    }
    AMI1
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          18496;
        startFace       1602395;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI2;
    }
    AMI2
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          18720;
        startFace       1620891;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI1;
    }
)

// ************************************************************************* //
